{
  "doc_id": "doc_20260206_105844_b5f457fa",
  "page": 2,
  "text": "1 \n \nمقدمة \nتعمل اللجنة الوطنية التقنية للكورونا والحمل في وزارة الصحة العامة على إعداد بروتوكوالت وطنية موحدة \nتتعلق بمتابعة الحمل والطلق والوالدة وما بعد الوالدة للمصابات او المشتبه بإصابته ن \n،بالكورونا وذلك لتوحيد \nوتسهيل األعمال الطبية للزميالت والزمالء. كما وتعمل أيضًا على إعداد مواد تدريبية لتدريب الزمالء من خالل \nورش عمل عن طريق تقنيات التواصل \n،المعلوماتية اضافة الى مواد تثقيفية تحاكي تساؤالت الحامل وأسرتها \nفيما يتعلق بالحماية والمتابعة والممارسات الصحية اليومية. كما وتعمل اللجنة على رصد ومتابعة حاالت الحمل \nالمصابة بالكورونا لضمها الى السجل الوطني لإلحصاء.\n \nالمعلومات حول كو\nرونا تتجدد بشكل دوري وسريع وتتغير معها بعض االرشادات. سوف تصلكم الموارد \nمن اللجنة تباعًا بحسب الدراسات واألدلة التي يتم تجديدها وتحديثها.\n \nتتطلع اللجنة الى تعاونكم واقتراحاتكم في هذا المجال.\n \nد فيصل القاق \nرئيس اللجنة الوطنية التقنية للكورونا والحمل في وزارة الصحة العامة \nاألعضاء: د. سعد الدين عيتاني رئيس الجمعية اللبنانية للتوليد واألمراض \n،النسائية د. جهاد الحسن رئيس دائرة \nالتوليد والجراحة النسائية في الجامعة \n،اللبنانية د. أنور نصار رئيس دائرة التوليد والجراحة النسائية في الجامعة \nاألميركية المركز \n،الطبي د. إيلي عطية رئيس دائرة التوليد والجراحة النسائية في الجامعة \n،اليسوعية د. رنا \nسكاف رئيس قسم التوليد في جامعة \n،البلمند د. طوني زريق رئيس دائرة التوليد والجراحة النسائية في الجامعة \nاللبنانية \n،األميركية د. ربيع شاهين رئيس دائرة التوليد والجراحة النسائية في مستشفى رفيق الحريري الحكومي \n،الجامعي د. وديع غنمة رئيس دائرة التوليد والجراحة النسائية جامعة \n،الكسليك د. ربيع شماعي مدير البرنامج \nالوطني للصحة \n،النفسية السيدة دعد العاكوم رئيسة نقابة القابالت \n،القانونيات السيدة وفاء كنعان دائرة الرعاية \nاألولية- وزارة الصحة العامة \nتتعاون اللجنة مع السيدة اسمى قرداحي- صندوق األمم المتحدة \n،للسكان د. رشا حمرا - رئيسة دائرة التثقيف \nفي وزارة الصحة \n \n \n \n \n \n",
  "lines": [],
  "blocks": [],
  "entities": [],
  "image_path": "data\\images\\doc_20260206_105844_b5f457fa\\raw\\page_0002.png",
  "preprocessed_image_path": "data\\images\\doc_20260206_105844_b5f457fa\\preprocessed\\page_0002.png",
  "ocr_fallback": true
}