{
  "doc_id": "doc_20260206_112620_13f82dd6",
  "page": 2,
  "text": " \nACKNOWLEDGMENT\n \n2 \nACKNOWLEDGMENT \n \nWe would like to express our heartfelt gratitude and appreciation \nto all those who have contributed to the successful completion of this \nproject. Their unwavering support, guidance, and encouragement have \nbeen invaluable throughout this journey. \n \nFirst and foremost, we extend our deepest gratitude to the Almighty \nGod for granting us the strength, wisdom, and perseverance to \nundertake and complete this project. Without the divine blessings and \ngrace, none of this would have been possible. \n \nWe are immensely grateful to Dr. Khaled Abdelsalam, whose expertise \nand guidance have been instrumental in shaping the direction of this \nproject. Dr. Khaled's extensive knowledge, insightful feedback, and \nconstant motivation have been crucial in refining our ideas and \nmethodologies. Their mentorship has truly been a privilege, and we are \nindebted to their invaluable contributions. \n \nWe would like to extend our appreciation to our fellow teammates who \nhave collaborated on this project. Their commitment, hard work, and \ndedication have been instrumental in overcoming challenges and \nachieving our goals. We are grateful for the sense of unity we shared \nthroughout this endeavor. \n \nWe would also like to express our gratitude to our families and friends \nwho have provided unwavering encouragement and understanding \nduring this project. Their love, patience, and belief in our abilities have \nbeen a constant source of motivation. \n \nLastly, we would like to acknowledge the contributions of all the \nindividuals who have provided assistance, feedback, or resources at \nvarious stages of this project. Your invaluable insights and support have \nenriched this work and made it possible to achieve our objectives. \nThank you. \n",
  "lines": [],
  "blocks": [],
  "entities": [],
  "image_path": "data\\images\\doc_20260206_112620_13f82dd6\\raw\\page_0002.png",
  "preprocessed_image_path": "data\\images\\doc_20260206_112620_13f82dd6\\preprocessed\\page_0002.png",
  "ocr_fallback": true
}