{
  "doc_id": "doc_20260206_112620_13f82dd6",
  "page": 102,
  "text": " \nREFERENCES\n \n102 \n[43] Z. Shi, S. Setlur, and V. Govindaraju, “Pre-processing Issues in \nArabic OCR,” in Guide to OCR for Arabic Scripts, London: Springer \nLondon, 2012, pp. 79–102. doi: 10.1007/978-1-4471-4072-6_4. \n[44] K. Safjan, “15 Tools for Document Deskewing and Dewarping,” \nKrystian’s Safjan Blog, 2022. \n[45] Joel, “Document Scanner using OpenCV (HoughLines Approach).” \nApr. 2020. [Online]. Available: https://medium.com/analytics-\nvidhya/document-scanner-using-opencv-houghlines-approach-\neb276dd4a0a \n[46] H. Feng, Y. Wang, W. Zhou, J. Deng, and H. Li, “DocTr: Document \nImage Transformer for Geometric Unwarping and Illumination \nCorrection,” in Proceedings of the 29th ACM International \nConference on Multimedia, 2021, pp. 273–281. \n[47] H. Feng, W. Zhou, J. Deng, Q. Tian, and H. Li, “DocScanner: Robust \nDocument Image Rectification with Progressive Learning,” arXiv \npreprint arXiv:2110.14968, 2021. \n[48] H. Feng, S. Liu, J. Deng, W. Zhou, and H. Li, “Deep Unrestricted \nDocument Image Rectification,” IEEE Trans Multimedia, 2023. \n[49] S. Das, K. Ma, Z. Shu, D. Samaras, and R. Shilkrot, “DewarpNet: \nSingle-Image Document Unwarping With Stacked 3D and 2D \nRegression Networks,” in The IEEE International Conference on \nComputer Vision (ICCV), Oct. 2019. \n[50] R. Santos, G. Clemente, T. Ing Ren, and G. Cavalcanti, “Text Line \nSegmentation Based on Morphology and Histogram Projection,” \nDocument Analysis and Recognition, International Conference on, \nvol. 0, pp. 651–655, Feb. 2009, doi: 10.1109/ICDAR.2009.183. \n[51] V. Alkalai Mohamed and Sorge, “A Histogram-Based Approach to \nMathematical Line Segmentation,” in Progress in Pattern \nRecognition, Image Analysis, Computer Vision, and Applications, G. \nRuiz-Shulcloper José and Sanniti di Baja, Ed., Berlin, Heidelberg: \nSpringer Berlin Heidelberg, 2013, pp. 447–455. \n[52] S. Russell and P. Norvig, Artificial Intelligence: A Modern Approach. \nPearson Higher Education, 2024. \n[53] D. Foead, A. Ghifari, M. B. Kusuma, N. Hanafiah, and E. Gunawan, “A \nSystematic Literature Review of A* Pathfinding,” Procedia Comput \n",
  "lines": [],
  "blocks": [],
  "entities": [],
  "image_path": "data\\images\\doc_20260206_112620_13f82dd6\\raw\\page_0102.png",
  "preprocessed_image_path": "data\\images\\doc_20260206_112620_13f82dd6\\preprocessed\\page_0102.png",
  "ocr_fallback": true
}