{
  "doc_id": "doc_20260206_112620_13f82dd6",
  "page": 39,
  "text": "CHAPTER 3 \nSYSTEM DESIGN\n \n39 \n3.2.1 Segmentation Based on Histogram Projections \n \n \nOur system relies on the utilization of histogram projections to \naccurately extract textual information from document images. The first \nstep in this technique is to obtain the vertical histogram of the white \npixels within the image. Vertical histogram represents the distribution of \npixel intensities or densities along the vertical axis of the document, \nproviding valuable insights into the locations of text lines. This helps to \nidentify the locations of individual characters or lines of text within a \ndocument image [50][51]. \n \nWith the vertical histogram in hand, the next step is to calculate a \nsuitable threshold. Our threshold was based on the weighted average of \nthe histogram values. This is done by computing the vertical histogram \nof the image and then calculating the weighted average of the \nhistogram by multiplying each histogram value with its corresponding \nrow index (y-coordinate) and then dividing the sum of these products \nby the total sum of the histogram values. \n \nThis threshold helps identify the gaps or spaces between text lines, \nwhich are considered as the \"valleys\" in the histogram. By isolating these \nvalley regions, the system can effectively segment the image into \nindividual text lines for further processing as shown in Figure 3.3. \n \nOnce the text lines have been extracted, the algorithm then employs a \npathfinding technique, to traverse the identified line regions from right \nto left. During this process, the system can discard any extraneous \nelements that fall outside the designated line areas, further refining the \nsegmentation. We used the A* (A-star) algorithm as a pathfinding \ntechnique [52][53]. It is a type of informed search algorithm that uses \nheuristics to estimate the cost of reaching the goal from a given node. \nIt is used to find the shortest or optimal path between two points in a \ngraph or a grid-based environment by maintaining a set of nodes to be \nexplored, known as the \"open set,\" and a set of nodes that have already \nbeen explored, known as the \"closed set.\" The algorithm starts by adding \n",
  "lines": [],
  "blocks": [],
  "entities": [],
  "image_path": "data\\images\\doc_20260206_112620_13f82dd6\\raw\\page_0039.png",
  "preprocessed_image_path": "data\\images\\doc_20260206_112620_13f82dd6\\preprocessed\\page_0039.png",
  "ocr_fallback": true
}