{
  "doc_id": "doc_20260206_112620_13f82dd6",
  "page": 94,
  "text": "CHAPTER 8 \nCONCLUSION AND FUTURE WORK\n \n94 \nCHAPTER 8 CONCLUSION AND FUTURE WORK \n8.1 Conclusion \n \n \nDriven by our passion for developing advanced text-processing \ntechniques in Arabic, we recognized their potential to bolster various \nareas we mentioned earlier (education, government, data analysis, and \ninformation retrieval). This dedication led us to closely monitor \nadvancements in Arabic handwriting recognition. We were particularly \nimpressed by the recent research paper \"Handwritten Arabic Bills \nReader and Recognizer.\" It motivated us to push our own research, \nculminating in noteworthy results. Our final model, the ResNet50V2, \npre-trained on the Arabic Alphabet Character dataset and further \ntrained on the main KHATT Dataset using advanced techniques and \noptimal hyperparameters, yielded significantly better performance \ncompared to the referenced research. This achievement, using a cosine \nlearning rate scheduler, Adam optimizer with an initial learning rate of \n0.001, β1 of 0.9, β2 of 0.999, and ε set to 1 x e-7, across 70 epochs, \nrepresents a substantial leap in accuracy (97%) and a low Character \nError Rate (CER) of only 3% on the test set. This accomplishment fuels \nour commitment to further research in this domain, with the ultimate \ngoal of achieving even more advanced levels of Arabic handwriting \nrecognition. \n \n8.2 Future Work \n \n \nThe Arabic language is rich in special characters and diacritics that \ncan significantly alter the meaning of a word. As a result, future research \nwill involve creating a more diverse dataset, and developing more \nsophisticated models that are specifically trained to recognize and \ninterpret these characters accurately across a more diverse dataset. \nThis could involve creating datasets from scratch; ones that focus on \nthese special characters and incorporating more complex models that \ncan capture the nuances of their usage and placement. We plan to focus \non collecting and preparing more comprehensive and diverse datasets. \nThis includes incorporating more datasets that represent different age \n",
  "lines": [],
  "blocks": [],
  "entities": [],
  "image_path": "data\\images\\doc_20260206_112620_13f82dd6\\raw\\page_0094.png",
  "preprocessed_image_path": "data\\images\\doc_20260206_112620_13f82dd6\\preprocessed\\page_0094.png",
  "ocr_fallback": true
}